import type Product from "./Product.ts";

// Соответствие размеров и ростов для рубашки
export const sizeToHeight: Record<string, string> = {
    "42": "158-164",
    "44": "164-170",
    "46": "170-176",
    "48": "170-176",
    "50": "176-182",
    "52": "176-182",
    "54": "176-182",
    "56": "182-188",
    "58": "182-188",
};

// Все доступные росты
export const heights = ["158-164", "164-170", "170-176", "176-182", "182-188"];

export const products: Product[] = [
    {
        id:1,
        image: "rubashka1.jpg",
        images: ["rubashka1.jpg", "rubashka2.jpg", "rubashka3.jpg"],
        name: "Рубашка BAD BAR",
        description: ["Прошлогодняя форма бара. Рваная, тёплая, свободная.",
        "",
        "В новом тираже мы докрутили посадку: слегка укоротили воротник и добавили длину в рукавах и самой рубашке.",
        "",
        "Может стать лёгкой курткой на осень/весну, или тёплой рубашкой поверх футболки.",
        "",
        "Материал: 70% хлопок, 15% шерсть, 15% полиэстер.",
        "Плотность: 500 г/м².",
        "Посадка: свободная.",
        "Застёжка на пуговицах.",
        "На воротнике и кармане вышивки.",
        "Уход: деликатная машинная стирка до 30 °C, без отбеливателя.",
        "",
        "<a href='guide_rubashka_42-58.pdf' target='_blank'>Гайд по размерам (PDF)</a>"
        ],
        priceRUB: 8000,
        priceEUR: 80,
        sizes: ["42", "44", "46", "48", "50", "52", "54", "56", "58"],
        types: null,
        have: true,
    }
]
